In [2]:
import pandas as pd
import numpy as np

In [27]:
sozluk1 = {"Isim": ["Ahmet", "Mehmet", "Zeynep", "At覺l"],
           "Spor": ["Kosu","Yuzme","Kosu","Basketbol"],
           "Kalori" : [100,200,300,400]
          }

sozluk2 = {"Isim" : ["Osman","Levent","Atlas","Fatma"], 
           "Spor" : ["Kosu", "YUzme","Kosu","Basketbol"],
          "Kalori" : [200,100,50,300]
          }
sozluk3 = {"Isim" : ["Ayse","Mahmut","Duygu","Nur"], 
           "Spor" : ["Kosu", "Yuzme","Badminton","Tenis"],
          "Kalori" : [300,400,500,250]
          }
dataFrame1 = pd.DataFrame(sozluk1,index=[0,1,2,3])
dataFrame2 = pd.DataFrame(sozluk2,index=[4,5,6,7])
dataFrame3 = pd.DataFrame(sozluk3,index=[8,9,10,11])

In [28]:
dataFrame1

     Isim       Spor  Kalori
0   Ahmet       Kosu     100
1  Mehmet      Yuzme     200
2  Zeynep       Kosu     300
3    At覺l  Basketbol     400

In [29]:
dataFrame2

     Isim       Spor  Kalori
4   Osman       Kosu     200
5  Levent      YUzme     100
6   Atlas       Kosu      50
7   Fatma  Basketbol     300

In [30]:
dataFrame3

      Isim       Spor  Kalori
8     Ayse       Kosu     300
9   Mahmut      Yuzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     250

## concetanation

In [31]:
pd.concat([dataFrame1,dataFrame2,dataFrame3],axis = 0)

      Isim       Spor  Kalori
0    Ahmet       Kosu     100
1   Mehmet      Yuzme     200
2   Zeynep       Kosu     300
3     At覺l  Basketbol     400
4    Osman       Kosu     200
5   Levent      YUzme     100
6    Atlas       Kosu      50
7    Fatma  Basketbol     300
8     Ayse       Kosu     300
9   Mahmut      Yuzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     250

## merge

In [35]:
mergeSozluk1 = {"Isim": ["Hasan","Basri","At覺l","Sule"],
               "Spor": ["Footbal", "Basketboll", "Swimming", "Football"] 
               }
mergeSozluk2 = {"Isim": ["Hasan","Basri","At覺l","Sule"],
               "Kalori": [100,200,300,400]
               }

mergeDataFrame1 = pd.DataFrame(mergeSozluk1)
mergeDataFrame2 = pd.DataFrame(mergeSozluk2)

In [36]:
mergeDataFrame1

    Isim        Spor
0  Hasan     Footbal
1  Basri  Basketboll
2   At覺l    Swimming
3   Sule    Football

In [37]:
mergeDataFrame2

    Isim  Kalori
0  Hasan     100
1  Basri     200
2   At覺l     300
3   Sule     400

In [38]:
pd.merge(mergeDataFrame1,mergeDataFrame2,on="Isim")

    Isim        Spor  Kalori
0  Hasan     Footbal     100
1  Basri  Basketboll     200
2   At覺l    Swimming     300
3   Sule    Football     400

In [40]:
maasSozluk = {"Departman": ["Yazilim","Yazilim","Satis","Pazarlama"],
             "Isim": ["Ahmet","Mehmet","At覺l","Hasan"],
              "Maas": [100,200,300,111]
             }

In [41]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [42]:
maasDataFrame

   Departman    Isim  Maas
0    Yazilim   Ahmet   100
1    Yazilim  Mehmet   200
2      Satis    At覺l   300
3  Pazarlama   Hasan   111

In [43]:
maasDataFrame["Departman"].unique()

array(['Yazilim', 'Satis', 'Pazarlama'], dtype=object)

In [44]:
maasDataFrame["Departman"].nunique()

3

In [45]:
maasDataFrame["Departman"].value_counts()

Yazilim      2
Satis        1
Pazarlama    1
Name: Departman, dtype: int64

In [46]:
def bruttenNete(maas):
    return maas * 0.66

In [48]:
maasDataFrame["Maas"].apply(bruttenNete)

0     66.00
1    132.00
2    198.00
3     73.26
Name: Maas, dtype: float64

In [49]:
maasDataFrame.isnull()

   Departman   Isim   Maas
0      False  False  False
1      False  False  False
2      False  False  False
3      False  False  False

In [50]:
yeniBirVeri = {"Karakter S覺n覺f覺" : ["South Park", "South Park", "Simpson", "Simpson","Simpson"],
              "Karakter Ismi" : ["Cartman", "Kenny", "Homer", "Bart","Bart"],
               "Karakter Yas" : [9,10,50,20,10]
              }
karakterDF = pd.DataFrame(yeniBirVeri)
karakterDF

  Karakter S覺n覺f覺 Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20
4         Simpson          Bart            10

In [51]:
karakterDF.pivot_table(values = "Karakter Yas", index = ["Karakter S覺n覺f覺", "Karakter Ismi"],aggfunc=np.sum)

                               Karakter Yas
Karakter S覺n覺f覺 Karakter Ismi
Simpson         Bart                     30
                Homer                    50
South Park      Cartman                   9
                Kenny                    10